// типы данных
// String - тип данных для текста 
// Number - тип данных для чисел 
// Boolean - тип данных для логических значений (true/false)
// null - специальное значение, которое означает "отсутствие значения" 
// undefined - тип данных который озночает что переменная не была инициализерованна 
// Object - тип данных для обектов которые  могкт содержать свойства и методы
// BigInt - тип данных для больших цель 
// Symbol - тип данных для уникальных идентификаторов


// let str = " hello world";
// console.log(typeof str);

// let a = 42;
// console.log(typeof a);

// let b = "12345678";
// console.log(typeof b);

// Условные оператор
// if (условие) {
// код который выполнится если условие именно} else {
// код который выполнится если условие ложно
// }

//  if (5<3) {
// console.log("5 больше 3");
//  } else {
// console.log(5 меньше 3);
//  }

// let age = 18;
// if (age >= 18) {
//   console.log("Вы совершеннолетний");
// } else {
//   console.log("Вы несовершеннолетний");
// }

// let jash = prompt ("жашыныз");
// let age = 19;
// if (age <= 19) {
//   alert("Вы совершеннолетний");
// } else {
//   alert("Вы несовершеннолетний");
// }




// homework
let age = prompt("Введите ваш возраст")
if (age <= 15) {
    alert("Салам балакай")
}
else if (age > 15 && age <= 30) {
    alert("Салам жигит")
}
else if (age > 30 && age <= 50) {
    alert("Салам байке")
}
else if (age > 50 && age <= 70) {
    alert("Салам ата")
}
else if (age > 70 && age <= 100) {
    alert("Салам чоң ата")
}
else if (age > 100) {
    alert("Ушундай да жаш болобу")
}






